app/controllers/accessions_controller.rb

  def index
    @recent = Patient.recent
    if params[:patient_id]
      @patient = Patient.find(params[:patient_id])
      @pending_accessions = @patient.accessions.pending(:order => 'drawn_at ASC')
      @reported_accessions = @patient.accessions.reported.recently.paginate(:per_page => 10, :page => params[:page])
---
SELECT * FROM "patients" WHERE ("patients"."id" = 1)
SELECT * FROM "accessions"

  def show
    @accession = Accession.find(params[:id])
    @results = @accession.results.all(:order => "lab_tests.position", :include => [{:lab_test => [:department, :unit, :lab_test_values, :reference_ranges]}]).group_by(&:department_name)
---
SELECT * FROM "accessions" WHERE ("accessions"."id" = 1)
SELECT * FROM "lab_tests" WHERE ("lab_tests"."id" = 1)

  def create
    @patient = Patient.find(params[:patient_id])
    @accession = @patient.accessions.build(params[:accession])
    if @accession.save
---
INSERT INTO "accessions" ("drawn_by", "updated_at", "patient_id", "received_by", "note", "drawn_at", "labels", "specimen_type_id", "stat", "other_id", "received_at", "diagnosis", "created_at") VALUES(1, '2009-07-22 01:43:29', 1, 1, '', '2009-07-22 01:32:00', 1, 1, 'f', NULL, '2009-07-22 01:32:00', 333.33, '2009-07-22 01:43:29')

  def edit
    @accession = Accession.find(params[:id], :include => [:panels, {:results => :lab_test}])
---
SELECT * FROM "accessions" WHERE ("accessions"."id" = 1)