app/controllers/lab_test_value_options_controller.rb

SELECT * FROM "lab_test_value_options"
---
  def index
    @lab_test_value_options = LabTestValueOption.all

SELECT * FROM "lab_test_value_options" WHERE ("lab_test_value_options"."id" = 1)
---
  def show
    @lab_test_value_option = LabTestValueOption.find(params[:id])

INSERT INTO "lab_test_value_options" ("ratio", "lab_test_id", "updated_at", "fraction", "text_length", "lab_test_value_id", "numeric", "range", "created_at") VALUES('f', 1, '2009-07-15 16:19:53', 'f', NULL, NULL, 't', 'f', '2009-07-15 16:19:53')
---
  def create
    @lab_test_value_option = LabTestValueOption.new(params[:lab_test_value_option])
    if @lab_test_value_option.save

SELECT * FROM "lab_test_value_options" WHERE ("lab_test_value_options"."id" = 1)
---
  def edit
    @lab_test_value_option = LabTestValueOption.find(params[:id])