app/controllers/lab_test_units_controller.rb

SELECT * FROM "lab_test_units"
---
  def index
    @lab_test_units = LabTestUnit.all

SELECT * FROM "lab_test_units" WHERE ("lab_test_units"."id" = 1)
---
  def show
    @lab_test_unit = LabTestUnit.find(params[:id])

INSERT INTO "lab_test_units" ("name", "updated_at", "created_at") VALUES('uL/m', '2009-07-15 14:05:50', '2009-07-15 14:05:50')
---
  def create
    @lab_test_unit = LabTestUnit.new(params[:lab_test_unit])
    if @lab_test_unit.save

SELECT * FROM "lab_test_units" WHERE ("lab_test_units"."id" = 1)
---
  def edit
    @lab_test_unit = LabTestUnit.find(params[:id])

SELECT * FROM "lab_test_units" WHERE ("lab_test_units"."id" = 1)
UPDATE "lab_test_units" SET "name" = ' L/m', "updated_at" = '2009-07-15 14:06:27' WHERE "id" = 1
---
  def update
    @lab_test_unit = LabTestUnit.find(params[:id])
    if @lab_test_unit.update_attributes(params[:lab_test_unit])