app/controllers/lab_test_normal_ranges_controller.rb

SELECT * FROM "lab_test_normal_ranges"
---
  def index
    @lab_test_normal_ranges = LabTestNormalRange.all

SELECT * FROM "lab_test_normal_ranges" WHERE ("lab_test_normal_ranges"."id" = 1)
---
  def show
    @lab_test_normal_range = LabTestNormalRange.find(params[:id])

INSERT INTO "lab_test_normal_ranges" ("min_age", "updated_at", "max", "age_unit", "gender", "min", "max_age", "created_at") VALUES(0, '2009-07-15 15:14:00', 10.0, 'Y', 'F', 1.0, 100, '2009-07-15 15:14:00')
---
  def create
    @lab_test_normal_range = LabTestNormalRange.new(params[:lab_test_normal_range])
    if @lab_test_normal_range.save

SELECT * FROM "lab_test_normal_ranges" WHERE ("lab_test_normal_ranges"."id" = 1)
---
  def edit
    @lab_test_normal_range = LabTestNormalRange.find(params[:id])

SELECT * FROM "lab_test_normal_ranges" WHERE ("lab_test_normal_ranges"."id" = 1)
UPDATE "lab_test_normal_ranges" SET "lab_test_id" = 1, "updated_at" = '2009-07-15 15:21:37' WHERE "id" = 1
---
  def update
    @lab_test_normal_range = LabTestNormalRange.find(params[:id])
    if @lab_test_normal_range.update_attributes(params[:lab_test_normal_range])