app/controllers/lab_test_results_controller.rb

  def index
    @accession = Accession.find(params[:accession_id])
    @results = @accession.lab_test_results.all(:include => [{ :lab_test => [ :lab_test_department, :lab_test_unit, :lab_test_values ] }], :order => 'lab_test_id').group_by(&:department_name)
---
SELECT * FROM "accessions" WHERE ("accessions"."id" = 1)
SELECT * FROM "lab_test_departments" WHERE ("lab_test_departments"."id" = 1)
SELECT * FROM "lab_test_results" WHERE ("lab_test_results".lab_test_id = 1)
SELECT * FROM "lab_test_units" WHERE ("lab_test_units"."id" = 1)
SELECT * FROM "lab_tests" WHERE ("lab_tests"."id" = 1)

  def create
    @lab_test_result = @accession.lab_test_results.new(params[:lab_test_result])
    if @lab_test_result.save
---
INSERT INTO "lab_test_results" ("lab_test_id", "updated_at", "accession_id", "value", "created_at") VALUES(1, '2009-07-22 02:28:17', 1, '15.2', '2009-07-22 02:28:17')

  def destroy
    @lab_test_result = @accession.lab_test_results.find(params[:id])
    @lab_test_result.destroy
---
SELECT * FROM "lab_test_results" WHERE ("lab_test_results"."id" = 2)
DELETE FROM "lab_test_results" WHERE "id" = 2