app/controllers/lab_tests_controller.rb

  def index
    @lab_tests = LabTest.all(:order => "position").group_by(&:department_name)
---
SELECT * FROM "lab_tests"

  def show
    @lab_test = LabTest.find(params[:id])
---
SELECT * FROM "lab_tests" WHERE ("lab_tests"."id" = 1)

  def create
    @lab_test = LabTest.new(params[:lab_test])
    if @lab_test.save
---
INSERT INTO "lab_tests" ("name", "updated_at", "code", "lab_test_department_id", "description", "decimals", "created_at") VALUES('BUN', '2009-07-15 14:36:48', 'BUN', 2, '', 2, '2009-07-15 14:36:48')

  def edit
    @lab_test = LabTest.find(params[:id])
---
SELECT * FROM "lab_tests" WHERE ("lab_tests"."id" = 1)

  def update
    @lab_test = LabTest.find(params[:id])
    if @lab_test.update_attributes(params[:lab_test])
---
SELECT * FROM "lab_tests" WHERE ("lab_tests"."id" = 1)
UPDATE "lab_tests" SET "lab_test_department_id" = 1, "updated_at" = '2009-07-15 14:23:31' WHERE "id" = 1