app/controllers/lab_test_panels_controller.rb

SELECT * FROM "lab_test_panels"
---
  def index
    @lab_test_panels = LabTestPanel.all

SELECT * FROM "lab_test_panels" WHERE ("lab_test_panels"."id" = 1)
---
  def show
    @lab_test_panel = LabTestPanel.find(params[:id])

INSERT INTO "lab_test_panels" ("name", "updated_at", "code", "description", "created_at") VALUES('Hemogram', '2009-07-21 13:27:21', 'HMGRM', 'Full Hemogram', '2009-07-21 13:27:21')
---
  def create
    @lab_test_panel = LabTestPanel.new(params[:lab_test_panel])
    if @lab_test_panel.save