app/controllers/lab_test_results_controller.rb

SELECT * FROM "lab_test_results" WHERE ("lab_test_results"."id" = 1)
---
  def show
    @lab_test_result = LabTestResult.find(params[:id])