app/controllers/lab_test_values_controller.rb

  def index
    @lab_test_values = LabTestValue.all
---
SELECT * FROM "lab_test_values"

  def show
    @lab_test_value = LabTestValue.find(params[:id])
---
SELECT * FROM "lab_test_values" WHERE ("lab_test_values"."id" = 1)

  def create
    @lab_test_value = LabTestValue.new(params[:lab_test_value])
    if @lab_test_value.save
---
INSERT INTO "lab_test_values" ("updated_at", "flag", "value", "note", "created_at") VALUES('2009-07-15 16:09:47', 'H', 'Positive', '', '2009-07-15 16:09:47')

  def edit
    @lab_test_value = LabTestValue.find(params[:id])
---
SELECT * FROM "lab_test_values" WHERE ("lab_test_values"."id" = 4)

  def update
    @lab_test_value = LabTestValue.find(params[:id])
    if @lab_test_value.update_attributes(params[:lab_test_value])
---
SELECT * FROM "lab_test_values" WHERE ("lab_test_values"."id" = 4)
UPDATE "lab_test_values" SET "value" = 'Trace', "updated_at" = '2009-07-15 16:13:21' WHERE "id" = 8