app/controllers/lab_test_departments_controller.rb

  def index
    @lab_test_departments = LabTestDepartment.all
---
SELECT * FROM "lab_test_departments"

  def show
    @lab_test_department = LabTestDepartment.find(params[:id])
---
SELECT * FROM "lab_test_departments" WHERE ("lab_test_departments"."id" = 1)

  def create
    @lab_test_department = LabTestDepartment.new(params[:lab_test_department])
    if @lab_test_department.save
---
INSERT INTO "lab_test_departments" ("name", "updated_at", "created_at") VALUES('Hematology', '2009-07-15 13:59:39', '2009-07-15 13:59:39')