app/controllers/patients_controller.rb

SELECT * FROM "patients"
---
  def index
    if params[:search].blank?
      #@patients = Patient.recent
      @patients = Patient.all

SELECT * FROM "patients" WHERE ("patients"."id" = 1)
---
  def show
    @patient = Patient.find(params[:id])

INSERT INTO "patients" ("family_name2", "updated_at", "birthdate", "gender", "given_name", "family_name", "identifier", "address", "middle_name", "created_at") VALUES('', '2009-07-12 03:58:57', '2004-07-12', 'M', 'Juan', 'Perez', '8-111-1111', '', '', '2009-07-12 03:58:57')
---
  def create
    @patient = Patient.new(params[:patient])
    if @patient.save

SELECT * FROM "patients" WHERE ("patients"."id" = 3)
---
  def edit
    @patient = Patient.find(params[:id])

SELECT * FROM "patients" WHERE ("patients"."id" = 1)
UPDATE "patients" SET "given_name" = 'Zsa', "birthdate" = '1917-02-06', "middle_name" = 'Zsa', "updated_at" = '2009-07-18 14:06:07' WHERE "id" = 3
---
  def update
    @patient = Patient.find(params[:id])
    if @patient.update_attributes(params[:patient])

SELECT * FROM "patients" WHERE ("patients"."id" = 4)
DELETE FROM "patients" WHERE "id" = 4
---
  def destroy
    @patient = Patient.find(params[:id])
    @patient.destroy