app/controllers/results_controller.rb

SELECT * FROM "results"
---
  def index
    @accession = Accession.find(params[:accession_id])
    @results = @accession.results.all(:include => [{ :lab_test => [ :department, :unit, :lab_test_values ] }], :order => 'lab_test_id').group_by(&:department_name)

INSERT INTO "results" ("updated_at", "value", "created_at") VALUES('2009-07-27 22:39:28', '15.2', '2009-07-27 22:39:28')
---
  def create
    @result = @accession.results.new(params[:result])
    if @result.save